
//КОММАНДЫ ДЛЯ ГИТА:
// 1) git init - в папке с проектом инициалзирует гит
// 2)  git config --global user.name "Egor" - конфигурационные комманды (local/global)
// 3) git status -статус файлов проекта (отслеживается или нет), какие файлы изменены
// 4) git add (-A / *.css / main.css ) - добавить все файлы для отслеживания и последующих коммитов
// 5)git commit -a -m"first commit" - создать контрольную точку, где заберутся все файлы, 
//        загрузит их в master ветку, с сообщением "first commit" 
// 6) git remote add origin https://github.com/MoonlightNdVodka/javascript_repository.git 
// добавляем удаленный репозиторий по ссылке, теперь наш локальный репозиторий связан с удаленным 
// и на удаленный репозиторий можно отпаравлять данные 
// 7) git push -u origin master - залить файлы на удаленный репозиторий в мастер ветку 
// 8)git clone https://github.com/MoonlightNdVodka/javascript_repository.git project_2 - клонировать файлы
//  из репозитория в новую папку 
// 9) git pull - подтянуть изменения с удаленного репозитория
// 10) .gitignore - файл, котороый позволяет добавлять файлы и библиотеки в исключения,
//  которые не будут подтягиваться в гит.
